QTY_TRANSACTIONS = True

CURRENCY = '€'
FPA = 1.24


UNIT = (
    ('1', 'Τεμάχια'),
    ('2', 'Κιλά'),
    ('3', 'Κιβώτια')
)

PAYMENT_TYPE = (
    ('1', 'Μετρητά'),
    ('2', 'Τραπεζική Κατάθεση'),
    ('3', 'Πιστωτική Κάρτα'),
    ('4', 'Paypal')
    )

PAYMENT_ORDER_TYPE = (
    ('order', 'Τιμολόγιο Αποθήκης'),
    ('retailorder', 'Παραστατικά Πώλησης'),
    ('fixedcostinvoice', 'Λογαριασμοί'),
    ('payrollinvoice', 'Μισθοδοσία'),
    )

BANKS = (
    ('0', 'No Bank'),
    ('1', 'Εθνική Τράπεζα'),
    ('2', 'Τράπεζα Πειραιώς'),
    ('3', 'Interamerican'),
    )


PAYMENT_METHOD = (
    ('a', 'Αποπληρωμή Τιμολογίου'),
    ('b', 'Προκαταβολές'),
    ('c', 'Επιταγές'),
    )

TAXES_CHOICES = (("1", '13'),
               ("2", "23"),
               ("3", "24"),
               ("4", "0")
               )

WAREHOUSE_OREDER_STATUS = (
    ('1', 'Ολοκληρώθηκε'),
    ('2', 'Δόσεις'),
    ('3', "Σε αναμονή"),
    ("4", "Ακυρώθηκε")
)


STATUS_SITE = (
    ('1','Σε απόθεμα'),
    ('2','Inactive'),
    ('3','Διαθέσιμο με παραγγελία'),
    ('4','Προσωρινά μη διαθέσιμο'),
)


#  retail
ORDER_TYPES = [('r', 'Λιανική Πώληση'),
               ('e', 'Eshop'),
               ('b', 'Επιστροφές'),
               ('d', 'Καταστροφή Προϊόντων'),
               ('wa', 'Παραστατικό Εισαγωγής'),
               ('wr', 'Παραστατικό Εξαγωγής'),
               ]

ORDER_STATUS = (
    ('1', 'Νέα Παραγγελία'),
    ('2', 'Σε Επεξεργασία'),
    ('3', 'Έτοιμο προς Αποστολή'),
    ('4', 'Απεστάλη'),
    ('5', 'Επιστράφηκε'),
    ('6', 'Ακυρώθηκε'),
    ('7', 'Εισπράκτηκε'),
        )


PAYROLL_CHOICES = (
    ('1', 'Μισθός'),
    ('2', 'ΙΚΑ'),
    ('3', 'ΑΣΦΑΛΙΣΤΙΚΕΣ ΕΙΣΦΟΡΕΣ'),
    ('4', 'ΗΜΕΡΟΜΗΣΘΙΟ'),
    ('5', 'ΕΡΓΟΣΗΜΟ'),
    ('6', 'ΔΩΡΟ')
    )

MEASURE_UNITS = (
    ('1', 'Τεμάχια'),
                 ('2', 'Κιλά'),
                 ('3', 'Κιβώτια')
                 )

STATUS = (('1', ''),('2', ''),('3', ''),('4', ''),)
